# Done By: Ajoke Yusuf
**HAMOYE ID: 14539cc72181f000**

In [1]:
import numpy as np

In [2]:
import pandas as pd

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = [‘Age’,’Nationality’,’Overall’]
**1) How do you create a pandas DataFrame using this list, to look like the table below?**

In [3]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age','Nationality','Overall']

In [4]:
pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

**2)Given the following numpy array** 

array  = ([[94, 89, 63],

           [93, 92, 48],

           [92, 94, 56]])

**How would you select  the elements in bold and italics from the array?**

In [5]:
array=np.array([[94, 89, 63],

           [93, 92, 48],

           [92, 94, 56]])
array[:2,1:]

array([[89, 63],
       [92, 48]])

**Consider the following list of tuples:**

y = [(2, 4), (7, 8), (1, 5, 9)]

**How would you assign element 8 from the list to a variable x?**

In [6]:
y = [(2, 4), (7, 8), (1, 5, 9)]

In [7]:
y[1][1]

8

**What would be the output for?**

S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

In [8]:
S = [['him', 'sell'], [90, 28, 43]]

In [9]:
S[0][1][1]

'e'

**Given the following python code, what would the output of the code give?**

my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

In [10]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

In [11]:
food_data=pd.read_csv(r'C:\Users\user\Documents\food dataset.csv')

In [12]:
food_data

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28
...,...,...,...,...,...,...,...,...,...,...,...,...
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,42.00,46.00,33.00,19.00,16.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.06,3.33,2.35,1.33,1.08
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,3.00,4.00,3.00,1.00,1.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.10,0.11,0.08,0.04,0.04
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.04,0.05,0.03,0.02,0.01

In [13]:
food_data.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [14]:
food_data.tail()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,42.00,46.00,33.00,19.00,16.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.06,3.33,2.35,1.33,1.08
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,3.00,4.00,3.00,1.00,1.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.10,0.11,0.08,0.04,0.04
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.04,0.05,0.03,0.02,0.01

**What is the total sum of Animal Fat produced in 2014 and 2017 respectively?**

Hint:

Perform a groupby sum aggregation on ‘Item’

In [15]:
food_data.groupby('Item').sum().loc[['Animal fats'],['Y2014','Y2017']]

                 Y2014      Y2017
Item
Animal fats  209460.54  269617.53

In [ ]:
**What is the mean and standard deviation across the whole dataset for the year 2015 to 3 decimal places?**

In [16]:
food_data.describe().loc[['mean','std'],['Y2015']]

            Y2015
mean   135.235966
std   1603.403984

In [ ]:
**What is the total number and percentage of missing data in 2016 to 2 decimal places?**

In [17]:
food_data['Y2016'].isnull().sum()

1535

In [ ]:
**Which year had the highest correlation with ‘Element Code’?**

In [ ]:
**What year has the highest sum of Import Quantity?**

Hint- Perform a groupby operation on ‘Element’ and use the resulting Dataframe to answer the question

In [18]:
food_data.groupby('Element').sum().loc['Import Quantity']

Area Code         688174.00
Item Code       13795966.00
Element Code    28834929.00
Y2014             274144.48
Y2015             267018.46
Y2016             286582.78
Y2017             294559.09
Y2018             287997.09
Name: Import Quantity, dtype: float64

In [ ]:
**What is the total number of the sum of Production in 2014?**

*Hint- Perform a groupby operation on ‘Element’ and use the resulting Dataframe to answer the question*

In [19]:
food_data.groupby('Element').sum().loc[['Production'],['Y2014']]

                 Y2014
Element
Production  1931287.75

In [ ]:
**Which of these elements had the highest sum in 2018?**

*Hint-  Select columns ‘Y2018’ and ‘Element’, 
Perform a groupby operation on ‘Element’ on the selected dataframe and answer the  question.*

In [20]:
food_data.groupby('Element').sum()['Y2018'].idxmax()

'Domestic supply quantity'

In [ ]:
**Which of these elements had the 3rd lowest sum in 2018?**

*Hint-  Select columns ‘Y2018’ and ‘Element’,
Perform a groupby operation on ‘Element’ on the selected dataframe and answer the  question.*

In [21]:
food_data.groupby(['Element']).sum()['Y2018'].nsmallest(3)

Element
Tourist consumption                          90.00
Fat supply quantity (g/capita/day)        10258.69
Protein supply quantity (g/capita/day)    11833.56
Name: Y2018, dtype: float64

In [ ]:
**What is the total number of unique countries in the dataset?**

In [22]:
food_data['Area'].nunique()

49